# 1. Берем легкий официальный образ Python
FROM python:3.12-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем файл зависимостей и устанавливаем их
# --no-cache-dir экономит место в образе
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# 4. Копируем весь остальной код проекта в контейнер
COPY . .

# 5. Команда, которая запустится при старте контейнера
# ВАЖНО: --host 0.0.0.0 обязателен, чтобы Docker мог пробросить порт наружу!
CMD ["uvicorn", "api:app", "--host", "0.0.0.0", "--port", "8000"]